package oop0905;

public class Test07_quiz {

	public static void main(String[] args) {
		//배열 연습문제
		
		char[] ch={'I', 't', 'W', 'i', 'l', 'l'};
		int size=ch.length; //6
		
		//문제1)대,소문자의 갯수를 각각 구하시오
        //->대문자 : 2개
        //->소문자 : 4개
		
		//문제2)대소문자를 서로 바꿔서 출력하시오
        //-> iTwILL	
		
		//문제3)모음의 갯수를 구하시오 AEIOUaeiou
        //-> 모음의 갯수 : 2개
////////////////////////////////////////////
		
		char[][] str= {
				{'Y','e','a','r'}
				,{'M','o','n','t','h'}
				,{'D','a','t','e'}
		};
		
		int row=str.length;	//3
		
		//문제4)각행의 모음의 갯수을 구하시오
        //->str[0]행 : 2개
        //->str[1]행 : 1개
        //->str[2]행 : 2개
		
///////////////////////////////////////////
		
		int[][] num= {
				{4,3,2}
			   ,{5,9,1}
			   ,{6,8,7}
		};
				
		//문5)대각선 방향의 각 요소의 합을 구하시오
        //   대각선 ↘ 방향의 합 (4+9+7)  
        //   대각선 ↙ 방향의 합 (2+9+6)
	}

}
